# Pandas (Day-1)

In [3]:
# importing necessary libraries
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [ ]:
pd.__version__

'2.2.3'

In [ ]:
# read data

df = pd.read_csv('./data/popdata.csv')

In [ ]:
# write data 
df.to_excel('./data/popdata.xlsx')

In [ ]:
# reading the exel file

df_xl =pd.read_excel('./data/popdata.xlsx')

# Pandas Tips

In [ ]:
# print the variables or data in terminal

print(df)

    Date(Year)  Population  Annual % Change        Name Area A (km²)  \
0         1950    39728535              NaN     Barguna        1,831
1         1951    40548590             2.06     Barisal        2,785
2         1952    41426885             2.17       Bhola        3,403
3         1953    42329279             2.18   Jhalakati          707
4         1954    43282032             2.25  Patuakhali        3,221
..         ...         ...              ...         ...          ...
68        2018   163683958             1.17         NaN          NaN
69        2019   165516222             1.12         NaN          NaN
70        2020   167420951             1.15         NaN          NaN
71        2021   169356251             1.16         NaN          NaN
72        2022   171186372             1.08         NaN          NaN

    Census_1991 Census_2001  Census_2011  Census _2022
0       775,693     848,554      892,781     1,010,530
1     2,207,426   2,355,967    2,324,310     2,570,450
2     1,476,328   1,703,117    1,776,795     1,932,514
3       666,139     694,231      682,669       661,161
4     1,273,872   1,460,781    1,535,854     1,727,254
..          ...         ...          ...           ...
68          NaN         NaN          NaN           NaN
69          NaN         NaN          NaN           NaN
70          NaN         NaN          NaN           NaN
71          NaN         NaN          NaN           NaN
72          NaN         NaN          NaN           NaN

[73 rows x 9 columns]

In [ ]:
# How the data looks like

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73 entries, 0 to 72
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date(Year)       73 non-null     int64
 1   Population       73 non-null     int64
 2   Annual % Change  72 non-null     float64
 3   Name             64 non-null     object
 4   Area A (km²)     64 non-null     object
 5    Census_1991     64 non-null     object
 6   Census_2001      64 non-null     object
 7    Census_2011     64 non-null     object
 8    Census _2022    64 non-null     object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.3+ KB

In [ ]:
df.head()

,Date(Year),Population,Annual % Change,Name,Area A (km²),Census_1991,Census_2001,Census_2011,Census _2022
0,1950,39728535,NaN,Barguna,"1,831","775,693","848,554","892,781","1,010,530"
1,1951,40548590,2.06,Barisal,"2,785","2,207,426","2,355,967","2,324,310","2,570,450"
2,1952,41426885,2.17,Bhola,"3,403","1,476,328","1,703,117","1,776,795","1,932,514"
3,1953,42329279,2.18,Jhalakati,707,"666,139","694,231","682,669","661,161"
4,1954,43282032,2.25,Patuakhali,"3,221","1,273,872","1,460,781","1,535,854","1,727,254"

In [ ]:
df.tail()

,Date(Year),Population,Annual % Change,Name,Area A (km²),Census_1991,Census_2001,Census_2011,Census _2022
68,2018,163683958,1.17,NaN,NaN,NaN,NaN,NaN,NaN
69,2019,165516222,1.12,NaN,NaN,NaN,NaN,NaN,NaN
70,2020,167420951,1.15,NaN,NaN,NaN,NaN,NaN,NaN
71,2021,169356251,1.16,NaN,NaN,NaN,NaN,NaN,NaN
72,2022,171186372,1.08,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.describe()

NameError: name 'df' is not defined

# Reverse Row Order

In [ ]:
import seaborn as sns
import pandas as pd

df= sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df.loc[::-1].head() # reverse the order of the data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [ ]:
df.loc[::-1].reset_index(drop=True).head() # reverse the order of the data and reset the index

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# reverse colum order

In [ ]:
df.loc[:, ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

In [ ]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [ ]:
# select those only numarical ["number"]

df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [ ]:
# select those only numarical ["object"]

df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [ ]:
# select those multiple data type["number", "object"]

df.select_dtypes(include=['number' , 'object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

# Convert String to number

In [ ]:
df = pd.DataFrame({ 'col_A': ["1", "2", "3", "4"],
                    'col_B' :["5", "6", "7", "8"]})
df

  col_A col_B
0     1     5
1     2     6
2     3     7
3     4     8

In [ ]:
df.dtypes

col_A    object
col_B    object
dtype: object

In [ ]:
df.astype({'col_A': 'int32', 'col_B': 'int32'}).dtypes

col_A    int32
col_B    int32
dtype: object

# reduce data frame size

In [ ]:
df= sns.load_dataset('titanic')
df.shape

(891, 15)

In [ ]:
df.sample(frac=0.1).shape
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [4]:
df.info

NameError: name 'df' is not defined